04_CFD/pipeline/sweep_run/cases/d+0p0_M0p100_aoa+4p0/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (33.947105 2.373813 0);

boundaryField
{
    mainfoil
    {
        type            noSlip;
    }

    flap
    {
        type            noSlip;
    }

    farfield
    {
        // freestream maneja entrada Y salida en la misma cara según el
        // signo local del flujo -- ideal para el borde curvo del dominio C
        type            freestreamVelocity;
        freestreamValue uniform (33.947105 2.373813 0);
    }

    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (33.947105 2.373813 0);
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
